Repository: quarkslab/pastis
Catalog: doc/locale/*/LC_MESSAGES/installation.po
Languages: fr

source: Pastis-DSE Installation
fr: Installation de Pastis-DSE

source: Pastis-dse relies on multiple dependencies. That must be installed beforehand. The steps to install it are:
fr: Pastis-DSE s'appuie sur plusieurs dépendances qui doivent être installées au préalable.Les étapes pour les installer sont:

source: Installing libpastis
fr: installer libpastis

source: Installing klocwork module
fr: installer le module klocwork

source: Installing Triton `(documentation) <https://triton.quarkslab.com/documentation/doxygen/index.html#install_sec>`_
fr: Installer Triton `(documentation) <https://triton.quarkslab.com/documentation/doxygen/index.html#install_sec>`_

source: Installing tritondse
fr: Installer tritondse

source: Then once all these dependencies are installed the installation can be made with:
fr: Une fois que ces dépendances sont installées, l'installation se fait simplement avec:

source: After installation the utility ``pastis-triton`` should be available in the PATH.
fr: Après installation l'utilitaire ``pastis-triton`` devrait être disponible dans le PATH.

source: Installing ``pastis-aflpp`` works by providing the afl-fuzz binary path through environment variable. It thus has to be installed before the Python module.
fr: L'utilisation de ``pastis-aflpp`` fonctionne en fournissant le chemin d'installation de afl-fuzz via une variable d'environnement. Ce module s'installe ensuite comme n'importe quel module Python.

source: Installing AFL++
fr: Installation de AFL++

source: Compiling the AFL++ is as simple as:
fr: Compiler la version de AFL++ est aussi simple que:

source: The only tricky part is the export of the afl++ directory as environment variable to make it discoverable by ``pastis-aflpp``. At the moment the module does not intent to find automatically the afl-fuzz binary.
fr: La seule subtilité est l'export du répertoire de afl++ comme variable d'environnement pour le rendre trouvable par ``pastis-aflpp``. Pour le moment aucune détection automatique n'est faite pour essayer de trouver afl-fuzz sans cet export.

source: Installing Pastis-AFLPP
fr: Installer Pastis-AFLPP

source: The only external dependency is ``libpastis``. It thus need to be installed first (see appropriate section). Then getting in the pastis-aflpp directory and install the module with:
fr: La seule dépendance externe est ``libpastis``. Cela requiert de l'installer en premier (voir section appropriée). Ensuite, en ce mettant dans le dossier du module, il suffit de faire:
