Repository: quarkslab/pastis
Catalog: doc/locale/*/LC_MESSAGES/usage.po
Languages: fr

source: pastis-broker usage
fr: Utilisation pastis-broker

source: Once installed, the binary ``pastis-broker`` is available in the PATH to launch the broker through command line. The command line arguments are the following:
fr: Une fois installé, le binaire :program:`pastis-broker` devrait être disponible dans le PATH pour exécuter le broker via la ligne de commande dont les arguments sont:

source: ``--workspace`` defines the directory where all runtime data will be stored. If it does not exists it is created, otherwise information are partially loaded from it. The utility can thus load all corpus and crash files from an existing workspace. Other files are essentially not reused.
fr: ``--workspace`` définit le dossier où toutes les données d'exécution vont être stockées. Si le dossier n'existe pas, il est créé. Autrement, les informations sont partiellement chargées de celui-ci. L'utilitaire peut charger le corpus et les crashs d'un workspace existant. Les autres fichiers ne sont pas réutilisés.

source: ``--kl-report`` Klocwork report to use if any. If a report is provided, clients are automatically launched in ``ALERT_ONLY`` mode otherwise they are launched in ``CHECK_ALL``.
fr: ``--kl-report`` Rapport Klocwork à utiliser *(s'il y en a un)*. Si un rapport est fourni,les clients sont automatiquement lancés dans le mode ``ALERT_ONLY``, autrement ils sont lancés en ``CHECK_ALL``.

source: ``--bins`` is the only mandatory parameter as it indicates an executable binary or a directory containing various variant of the same binary. Indeed, ``honggfuzz`` requires the binary to be compiled with instrumentation while ``triton`` need not. Similarly, depending on clients architecture the appropriate variant in the right architecture can be provided. ``pastis-broker`` automatically detects the various variant in a given directory which simplifies the broker usage as it will automatically provide the appropriate variant depending on client's capabilities. By using `LIEF <https://lief.quarkslab.com>`_ the following variants are detected:
fr: ``--bins`` est le seul paramètre obligatoire car il indique un programme ou un dossier contenant différentes variantes du même programme. En effet, ``honggfuzz`` requiert un binaire compilé avec son instrumentation alors que ``triton`` n'en a pas besoin. Similairement, en fonction de l'architecture du client, la variante dans la bonne architecture sera fourni.``pastis-broker`` détecte automatiquement les différentes variantes du dossier donné, ce qui simplifie l'utilisation du broker car il va fournir la bonne variante à un client donné. En utilisant `LIEF <https://lief.quarkslab.com>`_, les variantes suivantes sont détectées:

source: architecture : from ELF header
fr: architecture: à partir du header ELF

source: instrumentation : from functions of the program. If it contains references to "__sanitizer" then it is considered for ``honggfuzz`` otherwise for Triton
fr: instrumentation: à partir des fonctions du programme. S'il contient des références vers "__sanitizer" il est considéré pour ``honggfuzz``, sinon il est pour ``Triton``.

source: persistence : detect persistence through ``HF_ITER`` function presence or the presence of a token added in .rodata by Honggfuzz in the target.
fr: persistence : détecte la persistance via la présence de la fonction ``HF_ITER`` ou la présence du jeton ajouté dans .rodata par Honggfuzz dans la cible.

source: At the moment solely ELF Linux binaries are supported. Supporting other platforms would require extra engineering effort.
fr: Pour le moment seul les fichiers ELF et les binaires Linux sont supportés. Supporter d'autres plateformes nécessiterait des efforts supplémentaires d'ingénierie.

source: ``--mode`` defines the "broking" behavior for ``pastis-broker``. Possible values are:
fr: ``--mode`` définit le comportement du broker ``pastis-broker``. Les valeurs possibles sont:

source: ``FULL``: transmit all seeds to other clients. Performs the maximal sharing between peers
fr: ``FULL``: transmet toutes les graines à tous les clients. Il effectue un partage maximal entre les pairs.

source: ``NO_TRANSMIT``: receive data from clients but does not forward to one-another seeds
fr: ``NO_TRANSMIT``: reçois les données des clients mais ne transmet rien aux autres pairs.

source: ``COVERAGE_ORDERED``: transmit a seed to a client only if it has been launch with the same or more broad coverage metric. The relation order between metrics are block < edge < path. *(not implemented)*
fr: ``COVERAGE_ORDERED``: transmet une graine à un client, uniquement si celui-ci a été lancée avec la même métrique de couverture ou alors une plus large. La relation d'ordre est bloc < arête < chemin. *(non implémenté)*

source: ``--seed`` allows specifying a file or a directory of files containing the initial corpus for the campain.
fr: ``--seed`` permet de spécifier un fichier ou un dossier contenant le corpus initial de la campagne.

source: ``--tt-config`` Triton specific parameters to be sent as configuration to any Triton clients The file is a JSON file as defined in ``tritondse``. If the parameter is a directory all files contained inside will be considered as different configuration files. That enables launching different Triton instances with different parameters. In this case ``pastis-broker`` will launch a triton instance in each configuration and will loop if there is more.
fr: ``--tt-config`` paramètres spécifiques au moteur Triton. Ce fichier de configuration sera transmit à chaque instance de Triton lancée. Le fichier est un JSON dans le format décrit par ``tritondse``. Si le paramètre est un dossier tous les fichiers contenus dans ce dossier seront traités comme des configurations et chaque nouvelle instance de Triton sera lancée avec une configuration différente. Si plus d'instances sont exécutées, ``pastis-broker`` va boucler sur les configurations.

source: ``--hf-config`` Honggfuzz specific parameters to be sent to ``hf-wrapper``. The file is text file that will be transmitted as-is to honggfuzz command line. The parameter can also be a directory.
fr: ``--hf-config`` paramètres spécifiques à Honggfuzz qui seront passé à ``hf-wrapper``. Le fichier est un fichier texte qui sera transmit tel quel sur la ligne de commande de Honggfuzz. Le paramètre peut aussi être un dossier.

source: Without configuration specific files, pastis-broker will automatically equilibrate the coverage modes for clients. For instance three instances of Triton will each be launched with different coverage criteria (block, edge, path). Similarly, if a client support different fuzzing engines pastis-broker will automatically balances honggfuzz instances and Triton instances.
fr: Sans configuration spécifique, pastis-broker va automatiquement équilibrer les stratégies de couvertures entre les clients. Par exemple, trois instances de Triton seront chacune lancée avec une stratégie différente (block, arête, chemin). Similairement, si un client supporte différents moteurs de fuzzing, pastis-broker équilibrera automatiquement les instances de Honggfuzz et Triton.

source: pastisd usage
fr: Utilisation de pastisd

source: The utility ``pastisd`` is solely meant to be used with a broker. It can be run with:
fr: L'utilitaire ``pastisd`` est uniquement conçu pour fonctionner avec un broker. Il peut être exécuté avec:

source: Under these settings the host reached is **pastis.lan:5555**. Otherwise the host can be specified with:
fr: Sous cette configuration, l'hôte contacté est **pastis.lan:5555**. Autrement, l'hôte peut être spécifié avec:

source: In both cases, to use Honggfuzz the environment variable ``HF_PATH`` should be exported.
fr: Dans les deux cas, l'utilisation de Honggfuzz requiert d'exporter la variable d'environment ``HF_PATH``.
